#+TITLE: simargs
#+DATE: 2023-10-21T12:04:40+0800
#+LASTMOD: 2026-03-21T12:50:18+0800
#+TYPE: docs
#+WEIGHT: 10
#+DESCRIPTION: A simple, opinionated, struct-based argument parser in Zig, taking full advantage of [[https://kristoff.it/blog/what-is-zig-comptime/][comptime]].

* Features
- Supported data type:
  - All [[https://ziglang.org/documentation/0.15.2/#Primitive-Types][primitive types]], such as =i8=, =f32=, =bool=
  - =[]const u8=
  - =Enum=
- Optional fields and fields with default value mean they are optional arguments
- Use =comptime= as possible as I can
- Provide =printHelp()= out of the box
- Support sub commands
- Support =--version= flag via =version_string= option
* Usage
See [[https://github.com/jiacai2050/zigcli/blob/main/examples/simargs-demo.zig][simargs-demo.zig]].

#+begin_src zig
const simargs = @import("simargs");

var opt = try simargs.parse(allocator, struct {
    verbose: ?bool,
    @"user-agent": enum { Chrome, Firefox, Safari } = .Firefox,
    timeout: ?u16 = 30,
    output: []const u8,
    help: bool = false,
    version: bool = false,

    __commands__: union(enum) {
        sub1: struct {
            a: u64,
            help: bool = false,
        },
        sub2: struct { name: []const u8 },

        pub const __messages__ = .{
            .sub1 = "Subcommand 1",
            .sub2 = "Subcommand 2",
        };
    },

    pub const __shorts__ = .{
        .verbose = .v,
        .output = .o,
        .@"user-agent" = .A,
        .help = .h,
    };

    pub const __messages__ = .{
        .verbose = "Make the operation more talkative",
        .output = "Write to file instead of stdout",
        .timeout = "Max time this request can cost",
    };
}, .{
    .argument_prompt = "[file]",
    .version_string = "0.1.0",
});
defer opt.deinit();

// Access parsed options.
const output_path = opt.options.output;
const timeout = opt.options.timeout;

// Print help to stdout.
const stdout = std.fs.File.stdout();
var buffer: [1024]u8 = undefined;
var writer = stdout.writer(&buffer);
try opt.printHelp(&writer.interface);
try writer.interface.flush();
#+end_src

#+begin_src bash :results verbatim :exports results :wrap example
zig build run-simargs-demo -- -o /tmp/a.out --user-agent Firefox sub1 --a 123 hello world 2>&1
#+end_src

#+RESULTS:
#+begin_example
------------------------------Program------------------------------
simargs-demo

------------------------------Arguments------------------------------
   verbose: null
user-agent: .Firefox
   timeout: 30
    output: /tmp/a.out
      help: false
   version: false
__commands__: .{ .sub1 = .{ .a = 123, .help = false } }

------------------------------Positionals------------------------------
1: hello
2: world

------------------------------print_help------------------------------
 USAGE:
     simargs-demo [OPTIONS] [COMMANDS]

 COMMANDS:
  sub1       Subcommand 1
  sub2       Subcommand 2

 OPTIONS:
  -v, --verbose                    Make the operation more talkative
  -A, --user-agent STRING           (valid: Chrome|Firefox|Safari)(default: Firefox)
      --timeout INTEGER            Max time this request can cost(default: 30)
  -o, --output STRING              Write to file instead of stdout(required)
  -h, --help
      --version
#+end_example

* Acknowledgment
Blog post explaining how =simargs= is implemented: [[https://en.liujiacai.net/2022/12/14/argparser-in-zig/][What I learn by implementing argparser in Zig]].

When implement =simargs=, I refer following projects to learn how to write
idiomatic Zig code. Big Thanks!
- [[https://github.com/MasterQ32/zig-args/][MasterQ32/zig-args]]
- [[https://github.com/Hejsil/zig-clap][Hejsil/zig-clap]]
- [[https://github.com/evangrayk/zig-argparse][evangrayk/zig-argparse]]
